title: Attempts to detect potential COR_PROFILER environment variables manipulation via cmdline that could lead to execution flow hijacking
date: 2021/07/22
status: experimental
author: Emanuele De Lucia
description: Attempts to detect potential COR_PROFILER environment variables manipulation via cmdline that could lead to execution flow hijacking
date: 2021/07/22
references:
    - https://redcanary.com/blog/blue-mockingbird-cryptominer/
tags:
    - attack.t1574.012
logsource:
    category: process_creation
    product: windows
detection:
    cmdline:
        CommandLine|contains:
            - 'COR_ENABLE_PROFILING'
            - 'COR_PROFILER'
            - 'COR_PROFILER_PATH'
    condition: cmdline
falsepositives:
    - legitimate administrative tasks
level: medium
